In [1]:
import pandas as pd

In [2]:
dataset = pd.read_excel("students.xlsx")

In [3]:
dataset

    S/N     GIRLS   AGE  HEIGHT SCORES
0     1        Ann   14     5.5      80
1     2       Jane   16       6      85
2     3       Joan   14     5.4      70
3     4      Clare   17     5.9      60
4     5  Elizabeth   16     5.6      76
5   S/N       BOYS  AGE  HEIGHT  SCORES
6     1    Charles   15     5.7      85
7     2       Jude   16     5.9      74
8     3      James   16     5.8      87
9     4     Kelvin   17     6.1      75
10    5    Prosper   14     5.9      68

PSEUDOCODE FOR THE PROJECT DONE ABOVE





1)Open a new excel spreadsheet.




2)INPUT all given data.





3)To IMPORT, use the code below;
  
  
  import pandas as pd
 
 
 dataset = pd.read_excel("file name.xlsx")
  
  
  dataset







4)Commit to github(optional)

 ![](images/picture_1.png)